app/controllers/application_controller.rb

    def set_current_user
        # we exploit the fact that the below query may return nil
        @current_user = Moviegoer.find_by(:id => session[:user_id])
---
SELECT "moviegoers".* FROM "moviegoers" WHERE "moviegoers"."id" = ? ORDER BY "moviegoers"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]