app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN (?, ?, ?, ?) ORDER BY "movies"."id" ASC  [["rating", "G"], ["rating", "PG"], ["rating", "PG-13"], ["rating", "R"]]
---
  def index
    @movies = Movie.all
    @all_ratings = Movie.all_ratings
    @ratings_to_show = params[:ratings]&.keys || @all_ratings
    if @ratings_to_show.present?
      @movies = Movie.with_ratings(@ratings_to_show).order(params[:sort_var])

INSERT INTO "movies" ("title", "rating", "description", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Potato"], ["rating", "G"], ["description", nil], ["release_date", "2023-11-17 00:00:00"], ["created_at", "2023-11-17 19:24:44.032965"], ["updated_at", "2023-11-17 19:24:44.032965"]]
---
  def create
    begin
      @movie = Movie.create!(movie_params)

SELECT "movies".* FROM "movies" WHERE "movies"."id" IN (NULL)
---
  def edit
    @movie = Movie.find params[:id]

SELECT "movies".* FROM "movies" WHERE "movies"."id" IN (NULL)
UPDATE "movies" SET "title" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "Star Wars 2"], ["updated_at", "2023-11-15 16:10:29.523665"], ["id", 1]]
---
  def update
    @movie = Movie.find params[:id]
    if @movie.update(movie_params)
      redirect_to movie_path(@movie), :notice => "#{@movie.title} updated."
    else
      flash[:alert] = "#{@movie.title} could not be updated: " +
        @movie.errors.full_messages.join(",")