app/models/movie.rb

SELECT "movies"."rating" FROM "movies"
---
    def self.with_ratings(ratings_list)
        if ratings_list.present?