app/models/moviegoer.rb

INSERT INTO "moviegoers" ("name", "provider", "uid", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", nil], ["provider", "google_oauth2"], ["uid", "113202289440658482565"], ["created_at", "2023-11-15 05:34:19.237484"], ["updated_at", "2023-11-15 05:34:19.237484"]]
UPDATE "moviegoers" SET "name" = ?, "updated_at" = ? WHERE "moviegoers"."id" = ?  [["name", "Héctor Rubén Bobbio Hermoza"], ["updated_at", "2023-11-15 05:34:19.241368"], ["id", 1]]
---
        def from_omniauth(auth_hash)
          user = find_or_create_by(uid: auth_hash['uid'], provider: auth_hash['provider'])
          user.name = auth_hash['info']['name']
          user.save!